In [8]:
import pandas as pd

#### Creating a empty dataframe

In [11]:
df= pd.DataFrame()

In [15]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
list1 = list(range(5))

In [6]:
list1

[0, 1, 2, 3, 4]

In [12]:
df1=pd.DataFrame(list1)

In [13]:
df1

   0
0  0
1  1
2  2
3  3
4  4

In [22]:
list2 = [["naga",36],["alex",31],["John",25]]

In [23]:
df3 = pd.DataFrame(list2,columns=["Name","age"])

In [24]:
df3

   Name  age
0  naga   36
1  alex   31
2  John   25

In [26]:
dict1={"name":["naga","john","alex"],"age":[34,28,21]}

In [30]:
df4=pd.DataFrame(dict1,index=[100,101,102])

In [31]:
df4

     name  age
100  naga   34
101  john   28
102  alex   21

In [32]:
df4["name"]

100    naga
101    john
102    alex
Name: name, dtype: object

In [34]:
df4[["name","age"]]

     name  age
100  naga   34
101  john   28
102  alex   21

In [35]:
df4.columns

Index(['name', 'age'], dtype='object')

In [36]:
list_col=["name","age"]

In [37]:
df4[list_col]

     name  age
100  naga   34
101  john   28
102  alex   21

In [39]:
df4=pd.DataFrame(dict1,index=list(range(1000,1003)))

In [40]:
df4

      name  age
1000  naga   34
1001  john   28
1002  alex   21

In [42]:
## renaming the columns of a Dataframe
df4.rename(columns={"name":"name2"})

     name2  age
1000  naga   34
1001  john   28
1002  alex   21

In [46]:
# iloc uses the index ranges
df4.iloc[0:2,0:2]

      name  age
1000  naga   34
1001  john   28

In [48]:
# loc uses the actual label as index
df4.loc[:,["name","age"]]

      name  age
1000  naga   34
1001  john   28
1002  alex   21

In [52]:
dict2= {"name":["naga","john","alex","somu"],"age":[23,26,28,34],"location":["chennai","benagluru","hyderabad","mumbai"]}

In [53]:
df6=pd.DataFrame(dict2)

In [54]:
df6

   name  age   location
0  naga   23    chennai
1  john   26  benagluru
2  alex   28  hyderabad
3  somu   34     mumbai

In [55]:
gender=pd.Series(["Male","Male","Male","Male"])

In [56]:
gender

0    Male
1    Male
2    Male
3    Male
dtype: object

In [57]:
df6["Gender"]=gender

In [58]:
df6

   name  age   location Gender
0  naga   23    chennai   Male
1  john   26  benagluru   Male
2  alex   28  hyderabad   Male
3  somu   34     mumbai   Male

In [67]:
df6["age+15"]=df6["age"]+15

In [68]:
df6

   name  age   location Gender  age+10  age+15
0  naga   23    chennai   Male      33      38
1  john   26  benagluru   Male      36      41
2  alex   28  hyderabad   Male      38      43
3  somu   34     mumbai   Male      44      49

In [69]:
# one of the method to delete the column
del df6["age+15"]

In [70]:
df6

   name  age   location Gender  age+10
0  naga   23    chennai   Male      33
1  john   26  benagluru   Male      36
2  alex   28  hyderabad   Male      38
3  somu   34     mumbai   Male      44

In [71]:
df6.drop("age+10",axis=1,inplace=False)

   name  age   location Gender
0  naga   23    chennai   Male
1  john   26  benagluru   Male
2  alex   28  hyderabad   Male
3  somu   34     mumbai   Male

In [72]:
df6

   name  age   location Gender  age+10
0  naga   23    chennai   Male      33
1  john   26  benagluru   Male      36
2  alex   28  hyderabad   Male      38
3  somu   34     mumbai   Male      44

In [73]:
df6.drop("age+10",axis=1,inplace=True)

In [74]:
df6

   name  age   location Gender
0  naga   23    chennai   Male
1  john   26  benagluru   Male
2  alex   28  hyderabad   Male
3  somu   34     mumbai   Male

In [75]:
df6.drop(["Gender","location"],1,inplace=False)

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_12056/1023573416.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  df6.drop(["Gender","location"],1,inplace=False)

   name  age
0  naga   23
1  john   26
2  alex   28
3  somu   34

In [82]:
df6.drop(2,axis=0,inplace=False)

   name  age   location Gender
0  naga   23    chennai   Male
1  john   26  benagluru   Male
3  somu   34     mumbai   Male

In [88]:
df7=pd.DataFrame([["naga",26,"chennai"],["alex",34,"chennai"]],columns=["name","age","location"])

In [89]:
df8=pd.DataFrame([["sam",21,"chennai"],["Joe",36,"hyderabad"]],columns=["name","age","location"])

#### Pandas Append function tries to add data in rows based on common columns

In [90]:

df9=df8.append(df7)

In [91]:
df9

   name  age   location
0   sam   21    chennai
1   Joe   36  hyderabad
0  naga   26    chennai
1  alex   34    chennai

In [93]:
df10=pd.DataFrame(dict({"name":["a","b"],"age":[20,21]}))

In [94]:
df10

  name  age
0    a   20
1    b   21

#### df10['School'] = np.where(df10['Name'] == 'Kumar', 'KV', df10['School'])

In [97]:
df11=pd.DataFrame(dict({"Age":[25,26,25,23,30,29,23],"Name":["Tom","James","Ricky","Vin","steve","smith","jack"],"Rating":[4.23,3.24,3.98,2.56,3.20,4.60,3.80]}))

In [98]:
df11

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  steve    3.20
5   29  smith    4.60
6   23   jack    3.80

In [99]:
df11.head()

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  steve    3.20

In [100]:
df11.tail()

   Age   Name  Rating
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  steve    3.20
5   29  smith    4.60
6   23   jack    3.80

In [101]:
df11.T

           0      1      2     3      4      5     6
Age       25     26     25    23     30     29    23
Name     Tom  James  Ricky   Vin  steve  smith  jack
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [103]:
df11.axes

[RangeIndex(start=0, stop=7, step=1),
 Index(['Age', 'Name', 'Rating'], dtype='object')]

In [104]:
df11

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  steve    3.20
5   29  smith    4.60
6   23   jack    3.80

In [105]:
df11.dtypes

Age         int64
Name       object
Rating    float64
dtype: object

In [106]:
df11.shape

(7, 3)

In [107]:
df11.empty

False

In [109]:
df11.sum()

Age                                  181
Name      TomJamesRickyVinstevesmithjack
Rating                             25.61
dtype: object

In [111]:
df11.mean()

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_12056/576748174.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df11.mean()

Age       25.857143
Rating     3.658571
dtype: float64

In [112]:
import warnings
#warnings.filterwarnings('ignore')

In [113]:
df11.median()

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_12056/1895756546.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df11.median()

Age       25.0
Rating     3.8
dtype: float64

In [114]:
df11["Age"].mode()

0    23
1    25
dtype: int64

In [115]:
df11.std()

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_12056/346179282.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df11.std()

Age       2.734262
Rating    0.698628
dtype: float64

In [117]:
df11.count()

Age       7
Name      7
Rating    7
dtype: int64

In [118]:
df11['Age'].min()

23

In [119]:
df11['Age'].max()

30

In [120]:
df11.describe()

             Age    Rating
count   7.000000  7.000000
mean   25.857143  3.658571
std     2.734262  0.698628
min    23.000000  2.560000
25%    24.000000  3.220000
50%    25.000000  3.800000
75%    27.500000  4.105000
max    30.000000  4.600000

In [121]:
dict5={"col":[20,50,60,80,10],"col2":[80,60,40,20,55],"col3":[20,80,100,102,55]}

In [122]:
df12=pd.DataFrame(dict5)

In [123]:
df12

   col  col2  col3
0   20    80    20
1   50    60    80
2   60    40   100
3   80    20   102
4   10    55    55

In [125]:
import numpy as np
df12.apply(np.mean)

col     44.0
col2    51.0
col3    71.4
dtype: float64

In [126]:
df12.apply(lambda x:x.max()-x.min())

col     70
col2    60
col3    82
dtype: int64

In [131]:
a = [12,11,53,22,21,77,87,88,98]

# To filter out Odd numbers
b=list(filter(lambda x:x%2==0,a))
print("Odd Number list is ", b)
print("Square of the Odd Number list is ", list(map(lambda x : x**2,b)))

Odd Number list is  [12, 22, 88, 98]
Square of the Odd Number list is  [144, 484, 7744, 9604]

In [133]:
df12.rename(columns={"col":"Column1","col2":"Column2","col3":"Column3"})

   Column1  Column2  Column3
0       20       80       20
1       50       60       80
2       60       40      100
3       80       20      102
4       10       55       55

#### Creating the dataframe using random function

In [140]:
df13=pd.DataFrame(np.random.randn(5,2),index=[1,5,3,2,4],columns=["Column1","Column2"])
df13

    Column1   Column2
1 -0.400736  0.821681
5  0.621732 -1.710865
3 -1.551421  1.291658
2 -1.047615 -0.741138
4  0.564175 -0.033552

In [138]:
np.random.randn(5)

array([ 0.03208267,  0.43905302,  0.12257817, -0.4432024 , -0.05938329])

In [143]:
df13.sort_index(ascending=False)

    Column1   Column2
5  0.621732 -1.710865
4  0.564175 -0.033552
3 -1.551421  1.291658
2 -1.047615 -0.741138
1 -0.400736  0.821681

In [144]:
df13.sort_index()

    Column1   Column2
1 -0.400736  0.821681
2 -1.047615 -0.741138
3 -1.551421  1.291658
4  0.564175 -0.033552
5  0.621732 -1.710865

#### Sorting Columns

In [145]:
df13.sort_index(axis=1)

    Column1   Column2
1 -0.400736  0.821681
5  0.621732 -1.710865
3 -1.551421  1.291658
2 -1.047615 -0.741138
4  0.564175 -0.033552

In [148]:
df13.sort_values(by = "Column1",ascending = False)

    Column1   Column2
5  0.621732 -1.710865
4  0.564175 -0.033552
1 -0.400736  0.821681
2 -1.047615 -0.741138
3 -1.551421  1.291658

In [149]:
df11

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  steve    3.20
5   29  smith    4.60
6   23   jack    3.80

#### loc function

In [150]:
df11.loc?

In [153]:
df11.loc[:4,['Age','Name']]

   Age   Name
0   25    Tom
1   26  James
2   25  Ricky
3   23    Vin
4   30  steve

In [154]:
df11.loc[:3]

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98
3   23    Vin    2.56

In [155]:
df11.loc?

#### Changing the index of a dataframe

In [157]:
df11.index=['a','b','c','d','e','f','g']

In [158]:
df11

   Age   Name  Rating
a   25    Tom    4.23
b   26  James    3.24
c   25  Ricky    3.98
d   23    Vin    2.56
e   30  steve    3.20
f   29  smith    4.60
g   23   jack    3.80

In [163]:
df11.loc['a':'e',['Age','Name']]

   Age   Name
a   25    Tom
b   26  James
c   25  Ricky
d   23    Vin
e   30  steve

#### iloc function

In [164]:
# iloc uses the index values for getting the results
df11.iloc[:4,:3]

   Age   Name  Rating
a   25    Tom    4.23
b   26  James    3.24
c   25  Ricky    3.98
d   23    Vin    2.56

In [165]:
df11.iloc[:4,['Age','Name']]

IndexError: .iloc requires numeric indexers, got ['Age' 'Name']

#### Handling the missing data

In [223]:
df14=pd.DataFrame(np.random.randn(5,3),index=['a','b','c','d','e'],columns=['one','two','three'])

In [217]:
df14

        one       two     three
a -0.358351 -2.293608 -1.450837
b -1.325463 -0.351077 -1.609329
c  1.156392 -0.853560 -0.629685
d  0.675245 -1.716246 -0.226537
e -0.603835 -0.264137  0.804030

In [224]:
df15=df14.reindex(['a','b',3,4,'c','d','e'])

In [225]:
df15

        one       two     three
a -1.046836 -1.331552 -0.181608
b -1.457233 -1.487236  0.583029
3       NaN       NaN       NaN
4       NaN       NaN       NaN
c  1.149768 -0.635247 -1.210012
d  0.359684  0.993887 -0.022689
e  0.036697  0.242632 -1.235304

In [226]:
df15['three'].isnull().sum()

2

In [197]:
df11

   Age   Name  Rating
a   25    Tom    4.23
b   26  James    3.24
c   25  Ricky    3.98
d   23    Vin    2.56
e   30  steve    3.20
f   29  smith    4.60
g   23   jack    3.80

### Aggregation

In [205]:
df11.groupby(['Age','Name']).sum().reset_index()

   Age   Name  Rating  Score
0   23    Vin    2.56     50
1   23   jack    3.80     80
2   25  Ricky    3.98     40
3   25    Tom    4.23     20
4   26  James    3.24     30
5   29  smith    4.60     70
6   30  steve    3.20     60

In [199]:
df11['Score']=[20,30,40,50,60,70,80]

In [200]:
df11

   Age   Name  Rating  Score
a   25    Tom    4.23     20
b   26  James    3.24     30
c   25  Ricky    3.98     40
d   23    Vin    2.56     50
e   30  steve    3.20     60
f   29  smith    4.60     70
g   23   jack    3.80     80

In [202]:
df11.groupby(['Age'])['Score'].sum().reset_index()

   Age  Score
0   23    130
1   25     60
2   26     30
3   29     70
4   30     60

In [204]:
df11.groupby(['Age'])["Score","Rating"].agg([np.mean,np.median]).reset_index()

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_12056/1146982314.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df11.groupby(['Age'])["Score","Rating"].agg([np.mean,np.median]).reset_index()

  Age Score        Rating
       mean median   mean median
0  23  65.0   65.0  3.180  3.180
1  25  30.0   30.0  4.105  4.105
2  26  30.0   30.0  3.240  3.240
3  29  70.0   70.0  4.600  4.600
4  30  60.0   60.0  3.200  3.200

In [208]:
df_left=pd.DataFrame(dict({"Name":["Alex","Amy","Allen","Alice","Ayoung"],"id":[1,2,3,4,5],"Subject_id":["sub1","sub2","sub3","sub4","sub5"]}))

In [209]:
df_right=pd.DataFrame(dict({"Name":["Bob","Billy","Bety","Bran","Bruce"],"id":[1,2,3,4,5],"Subject_id":["sub6","sub7","sub8","sub9","sub10"]}))

In [210]:
df_left

     Name  id Subject_id
0    Alex   1       sub1
1     Amy   2       sub2
2   Allen   3       sub3
3   Alice   4       sub4
4  Ayoung   5       sub5

In [211]:
df_right

    Name  id Subject_id
0    Bob   1       sub6
1  Billy   2       sub7
2   Bety   3       sub8
3   Bran   4       sub9
4  Bruce   5      sub10

#### merge with one key

In [212]:
pd.merge(df_left,df_right,on='id')

   Name_x  id Subject_id_x Name_y Subject_id_y
0    Alex   1         sub1    Bob         sub6
1     Amy   2         sub2  Billy         sub7
2   Allen   3         sub3   Bety         sub8
3   Alice   4         sub4   Bran         sub9
4  Ayoung   5         sub5  Bruce        sub10

#### merge operation using 'how'

In [216]:
df_left.merge(df_right,on="Subject_id",how='left')

   Name_x  id_x Subject_id Name_y  id_y
0    Alex     1       sub1    NaN   NaN
1     Amy     2       sub2    NaN   NaN
2   Allen     3       sub3    NaN   NaN
3   Alice     4       sub4    NaN   NaN
4  Ayoung     5       sub5    NaN   NaN

#### Concat

In [227]:
pd.concat([df_left,df_right],axis=1) # column wise concat operation

     Name  id Subject_id   Name  id Subject_id
0    Alex   1       sub1    Bob   1       sub6
1     Amy   2       sub2  Billy   2       sub7
2   Allen   3       sub3   Bety   3       sub8
3   Alice   4       sub4   Bran   4       sub9
4  Ayoung   5       sub5  Bruce   5      sub10

In [230]:
pd.concat([df_left,df_right]) # default row wise concat operation

     Name  id Subject_id
0    Alex   1       sub1
1     Amy   2       sub2
2   Allen   3       sub3
3   Alice   4       sub4
4  Ayoung   5       sub5
0     Bob   1       sub6
1   Billy   2       sub7
2    Bety   3       sub8
3    Bran   4       sub9
4   Bruce   5      sub10

In [231]:
pd.concat([df_left,df_right],ignore_index=True) # default row wise concat operation

     Name  id Subject_id
0    Alex   1       sub1
1     Amy   2       sub2
2   Allen   3       sub3
3   Alice   4       sub4
4  Ayoung   5       sub5
5     Bob   1       sub6
6   Billy   2       sub7
7    Bety   3       sub8
8    Bran   4       sub9
9   Bruce   5      sub10

#### Append operation to demonstrate the similar functionality of concat

In [233]:
df_left.append(df_right,ignore_index=True)

     Name  id Subject_id
0    Alex   1       sub1
1     Amy   2       sub2
2   Allen   3       sub3
3   Alice   4       sub4
4  Ayoung   5       sub5
5     Bob   1       sub6
6   Billy   2       sub7
7    Bety   3       sub8
8    Bran   4       sub9
9   Bruce   5      sub10

In [235]:
df_left.append?